import React from "react";

export default function About() {
  return (
    <div className="py-16 bg-white w-full">
      <h1 className="text-3xl font-bold text-center mb-8 text-gray-800">
        महाकुंभ 2025
      </h1>
      <div className="flex justify-center items-center mb-8">
        <img
          src="src/assets/images/logo2.jpg"
          alt="Logo"
          className="max-w-xs sm:max-w-sm md:max-w-md lg:max-w-screen-lg rounded-lg shadow-md"
        />
      </div>
      <section className="container mx-auto px-4 grid grid-cols-1 md:grid-cols-2 gap-8">
        <div className="box-1 bg-gray-100 p-4 rounded-lg shadow-md">
          <h1 className="text-lg font-semibold text-gray-700 mb-4">
            महाकुंभ सबसे पहली बार कब और क्यों लगा था, कुंभ से जुड़े ये रहस्य
            नहीं जानते होंगे आप
          </h1>
          <img
            src="src/assets/images/about1.webp"
            alt="Image 1"
            className="w-full h-auto rounded-lg mb-4"
          />
          <p className="text-gray-600 text-justify leading-6">
            महाकुंभ करोड़ों श्रद्धालुओं की आस्था का प्रतीक है। महाकुंभ सिर्फ एक
            मेला नहीं है बल्कि यह आस्था, परंपरा और हिंदू संस्कृति का संगम है।
            श्रद्धालुओं के लिए यह एक पवित्र एहसास है। जिसका इंतजार सभी
            श्रद्धालुओं को बेसब्री से रहता है। इस साल 13 जनवरी से लगने जा रहा
            महाकुंभ का मेला कई मायनों में बेहद खास होने वाला है। इस बार 144 साल
            बाद पूर्ण महाकुंभ लग रहा है। सरल शब्दों में समझें तो 12 साल लगातार
            12 वर्षों के तक लगने के बाद पूर्ण महाकुंभ लगता है। जो 144 साल बाद
            आता है। महाकुंभ का आयोजन इस बार प्रयागराज में हो रहा है। इस बार
            महाकुंभ में क्या कुछ खास होने वाला है। इसके बारे में तो आप सभी जानते
            ही होंगे लेकिन, क्या आप जानते हैं महाकुंभ का इतिहास वर्षों पुराना
            है। महाकुंभ से जुड़े कई ऐसे रहस्य हमारे ग्रंथों में छिपे हुए हैं
            जिन्हें उजागर करना जरूरी है। तो आइए जानते हैं महाकुंभ से जुड़े कुछ
            रहस्य। साथ ही जानते हैं कब और कहा सबसे पहले हुआ था महाकुंभ का आयोजन।
          </p>
        </div>
        <div className="box-2 bg-gray-100 p-4 rounded-lg shadow-md">
          <h1 className="text-lg font-semibold text-gray-700 mb-4">
            कितना पुराना है महाकुंभ का इतिहास
          </h1>
          <img
            src="src/assets/images/about2.webp"
            alt="Image 2"
            className="w-full h-auto rounded-lg mb-4"
          />
          <p className="text-gray-600 text-justify leading-6">
            कुछ ग्रंथों में बताया गया है कि कुंभ मेला का आयोजन 850 साल से भी
            ज्यादा पुराना है। आदि शंकराचार्य द्वारा महाकुंभ की शुरुआत की गई थी।
            कुछ कथाओं में बताया गया है कि कुंभ का आयोजन समुद्र मंथन के बाद से ही
            किया जा रहा है। जबकि कुछ विद्वानों का कहना है कि गुप्त काल के दौरान
            से ही इसकी शुरुआत हुई थी। लेकिन सम्राट हर्षवर्धन से इसके प्रमाण
            देखने को मिलते हैं। इसी के बाद शंकराचार्य और उनके शिष्यों द्वारा
            संन्यासी अखाड़ों के लिए संगम तट पर शाही स्नान की व्यवस्था की गई थी।
          </p>
        </div>
        <div className="box-3 bg-gray-100 p-4 rounded-lg shadow-md">
          <h1 className="text-lg font-semibold text-gray-700 mb-4">
            कुंभ मेले के आयोजन को लेकर मान्यता
          </h1>
          <img
            src="src/assets/images/about3.webp"
            alt="Image 3"
            className="w-full h-auto rounded-lg mb-4"
          />
          <p className="text-gray-600 text-justify leading-6">
            हालांकि, कुछ ऐतिहासिक साक्ष्य यह भी मिलते हैं जिनसे सिद्ध होता है कि
            कुंभ का आयोजन राजा हर्षवर्धन के राज्य काल में आरंभ हुआ था। प्रसिद्ध
            चीनी यात्री ह्वेनसांग जब अपनी भारत यात्रा के बाद उन्होंने कुंभ मेले
            के आयोजन का उल्लेख किया था। इसी के साथ उन्होंने राजा हर्षवर्धन का भी
            जिक्र किया है। उनके दयालु स्वभाव के बारे में भी उन्होंने जिक्र किया
            था। ह्वेनसांग ने कहा था कि राजा हर्षवर्धन लगभग हर 5 साल में नदियों
            के संगम पर एक बड़ा आयोजन करते थे। जिसमें वह अपना पूरा कोष गरीबों और
            धार्मिक लोगों को दान में दे दिया करते थे।
          </p>
        </div>
        <div className="box-4 bg-gray-100 p-4 rounded-lg shadow-md">
          <h1 className="text-lg font-semibold text-gray-700 mb-4">
            महाकुंभ और समुद्र मंथन के रहस्य
          </h1>
          <img
            src="src/assets/images/about5.webp"
            alt="Image 4"
            className="w-full h-auto rounded-lg mb-4"
          />
          <p className="text-gray-600 text-justify leading-6">
            समुद्र मंथन के बारे में शिव पुराण, मत्स्य पुराण, पद्म पुराण, भविष्य
            पुराण समेत लगभग सभी पुराणों में जिक्र किया गया है। मान्यताओं के
            अनुसार, समुद्र मंथन के दौरान जब अमृत कलश बाहर आया था तब देवताओं और
            राक्षसों के बीच तनातनी और संघर्ष को कम करने के लिए भगवान विष्णु ने
            मोहिनी अवतार लिया था। इसके बाद जब देवताओं और राक्षसों के बीच संघर्ष
            काफी ज्यादा बढ़ गया तो उन्होंने इंद्र देव के पुत्र जयंत को यह अमृत
            कलश सौंप दिया गया। जयंत कौवे का रूप धारण कर राक्षसों से अमृत कलश को
            छिनकर उड़ चले थे। जब वह घट को लेकर भाग रहे थे तो अमृत कलश से कुछ
            बूंदे प्रयागराज, उज्जैन , हरिद्वार और नासिक में गिर गई थी। जहां जहां
            अमृत कलश की बूंदे गिरी वहां-वहां कुंभ मेला का आयोजन किया जाता है।
          </p>
        </div>
      </section>
    </div>
  );
}
